espruino/Espruino/libs/banglejs/banglejs3_py32/libs/hal/inc/py32f07x_hal_can.h
  uint32_t                      LastTimeTrigType;          /*!< CAN last time trig type */

  uint32_t                      LastAbortTxType;           /*!< CAN last abort transmit type */

  uint32_t                      LastSTBTxType;             /*!< CAN last STB transmit type */

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
  void (* RxCpltCallback)(__CAN_HandleTypeDef *hcan);
  void (* RxFifoAlmostFullCallback)(__CAN_HandleTypeDef *hcan);
  void (* RxFifoFullCallback)(__CAN_HandleTypeDef *hcan);
  void (* PtbTxCpltCallback)(__CAN_HandleTypeDef *hcan);
  void (* StbTxCpltCallback)(__CAN_HandleTypeDef *hcan, uint32_t LastSTBTxType);
  void (* RxFifoOverflowCallback)(__CAN_HandleTypeDef *hcan);
  void (* ArbitrationLostCallback)(__CAN_HandleTypeDef *hcan);
  void (* TxAbortCallback)(__CAN_HandleTypeDef *hcan, uint32_t LastAbortTxType);
  void (* PassiveErrorCallback)(__CAN_HandleTypeDef *hcan);
  void (* BusErrorCallback)(__CAN_HandleTypeDef *hcan);
  void (* ErrorChangeCallback)(__CAN_HandleTypeDef *hcan);
  void (* TT_RxTimeTrigCallback)(__CAN_HandleTypeDef *hcan);
  void (* TT_TxSingleTrigCallback)(__CAN_HandleTypeDef *hcan);
  void (* TT_TxStartTrigCallback)(__CAN_HandleTypeDef *hcan);
  void (* TT_TxStopTrigCallback)(__CAN_HandleTypeDef *hcan);
  void (* TT_TimestampWraparoundCallback)(__CAN_HandleTypeDef *hcan);
  void (* TT_TrigErrorCallback)(__CAN_HandleTypeDef *hcan);  
  
  void (* MspInitCallback)(struct __CAN_HandleTypeDef *hfdcan);                     /*!< CAN Msp Init callback              */
  void (* MspDeInitCallback)(struct __CAN_HandleTypeDef *hfdcan);                   /*!< CAN Msp DeInit callback            */
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */

} CAN_HandleTypeDef;

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
/**
  * @brief  HAL CAN common Callback ID enumeration definition
  */
typedef enum
{
  HAL_CAN_RX_COMPLETE_CB_ID             = 0x00U,    /*!< CAN Rx complete callback ID                */
  HAL_CAN_RX_FIFO_ALMOST_FULL_CB_ID     = 0x01U,    /*!< CAN Rx fifo almost full callback ID        */
  HAL_CAN_RX_FIFO_FULL_CB_ID            = 0x02U,    /*!< CAN Rx fifo full callback ID               */
  HAL_CAN_PTB_TX_COMPLETE_CB_ID         = 0x03U,    /*!< CAN PTB Tx complete callback ID            */
  HAL_CAN_STB_TX_COMPLETE_CB_ID         = 0x04U,    /*!< CAN STB Tx complete callback ID            */
  HAL_CAN_TX_ABORT_CB_ID                = 0x05U,    /*!< CAN Tx abort callback ID                   */
  HAL_CAN_RX_FIFO_OVERFLOW_CB_ID        = 0x06U,    /*!< CAN Rx fifo overflow callback ID           */
  HAL_CAN_ARBITRATION_LOST_CB_ID        = 0x07U,    /*!< CAN Arbitration lost callback ID           */

  HAL_CAN_PASSIVE_ERROR_CB_ID           = 0x08U,    /*!< CAN Passive error callback ID              */
  HAL_CAN_BUS_ERROR_CB_ID               = 0x09U,    /*!< CAN Bus error callback ID                  */
  HAL_CAN_ERROR_CHANGE_CB_ID            = 0x0AU,    /*!< CAN Error change callback ID               */

  HAL_CAN_TT_RX_TIME_TRIG_CB_ID         = 0x0BU,    /*!< CAN TT Rx time trig callback ID            */
  HAL_CAN_TT_TX_SINGLE_TRIG_CB_ID       = 0x0CU,    /*!< CAN TT Tx single trig callback ID          */
  HAL_CAN_TT_TX_START_TRIG_CB_ID        = 0x0DU,    /*!< CAN TT Tx start trig callback ID           */
  HAL_CAN_TT_TX_STOP_TRIG_CB_ID         = 0x0EU,    /*!< CAN TT Tx stop trig callback ID            */
  HAL_CAN_TT_TIMESTAMP_WRAPAROUND_CB_ID = 0x0FU,    /*!< CAN TT timestamp wraparound callback ID    */

  HAL_CAN_TT_TRIG_ERROR_CB_ID           = 0x10U,    /*!< CAN TT trig error callback ID              */

  HAL_CAN_MSPINIT_CB_ID                 = 0x11U,    /*!< CAN MspInit callback ID                    */
  HAL_CAN_MSPDEINIT_CB_ID               = 0x12U,    /*!< CAN MspDeInit callback ID                  */

} HAL_CAN_CallbackIDTypeDef;

/**
  * @brief  HAL CAN Callback pointer definition
  */
typedef  void (*pCAN_CallbackTypeDef)(CAN_HandleTypeDef *hcan);     /*!< pointer to a common CAN callback function */

#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */

/** @defgroup HAL_CAN_Error_Code HAL CAN Error Code
  * @{
  */
#define HAL_CAN_ERROR_NONE            ((uint32_t)0x00000000U) /*!< No error                                                               */
#define HAL_CAN_ERROR_TIMEOUT         ((uint32_t)0x00000001U) /*!< Timeout error                                                          */
#define HAL_CAN_ERROR_NOT_INITIALIZED ((uint32_t)0x00000002U) /*!< Peripheral not initialized                                             */
#define HAL_CAN_ERROR_NOT_READY       ((uint32_t)0x00000004U) /*!< Peripheral not ready                                                   */
#define HAL_CAN_ERROR_NOT_STARTED     ((uint32_t)0x00000008U) /*!< Peripheral not started                                                 */
#define HAL_CAN_ERROR_NOT_SUPPORTED   ((uint32_t)0x00000010U) /*!< Mode not supported                                                     */
#define HAL_CAN_ERROR_PARAM           ((uint32_t)0x00000020U) /*!< Parameter error                                                        */
#define HAL_CAN_ERROR_PENDING         ((uint32_t)0x00000040U) /*!< Pending operation                                                      */
#define HAL_CAN_ERROR_RAM_ACCESS      ((uint32_t)0x00000080U) /*!< Message RAM Access Failure                                             */
#define HAL_CAN_ERROR_FIFO_EMPTY      ((uint32_t)0x00000100U) /*!< Get element from empty FIFO                                            */
#define HAL_CAN_ERROR_FIFO_FULL       ((uint32_t)0x00000200U) /*!< Put element in full FIFO                                               */

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
#define HAL_CAN_ERROR_INVALID_CALLBACK ((uint32_t)0x00000400U) /*!< Invalid Callback error                                                */
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
/**
  * @}
  */
  
/** @defgroup CAN_frame_format CAN Frame Format
  * @{
  */
#define CAN_FRAME_CLASSIC   ((uint32_t)0x00000000U)                     /*!< Classic mode                      */
/**
  * @}
  */

/** @defgroup CAN_data_length_code CAN Data Length Code
  * @{
  */
#define CAN_DLC_BYTES_0              ((uint32_t)0x00000000U) /*!< 0 bytes data field  */
#define CAN_DLC_BYTES_1              ((uint32_t)0x00000001U) /*!< 1 bytes data field  */
#define CAN_DLC_BYTES_2              ((uint32_t)0x00000002U) /*!< 2 bytes data field  */
#define CAN_DLC_BYTES_3              ((uint32_t)0x00000003U) /*!< 3 bytes data field  */
#define CAN_DLC_BYTES_4              ((uint32_t)0x00000004U) /*!< 4 bytes data field  */
#define CAN_DLC_BYTES_5              ((uint32_t)0x00000005U) /*!< 5 bytes data field  */
#define CAN_DLC_BYTES_6              ((uint32_t)0x00000006U) /*!< 6 bytes data field  */
#define CAN_DLC_BYTES_7              ((uint32_t)0x00000007U) /*!< 7 bytes data field  */
#define CAN_DLC_BYTES_8              ((uint32_t)0x00000008U) /*!< 8 bytes data field  */
/**
  * @}
  */

