espruino/Espruino/libs/banglejs/banglejs3_py32/libs/hal/inc/py32f07x_hal_can.h
/** @defgroup CAN_LLC_FORMAT_BITS CAN LLC format bits
  * @{
  */
#define CAN_LLC_FORMAT_DLC_0         ((uint32_t)0x00000001U)         /*!< BIT DLC_0  */
#define CAN_LLC_FORMAT_DLC_1         ((uint32_t)0x00000002U)         /*!< BIT DLC_1  */
#define CAN_LLC_FORMAT_DLC_2         ((uint32_t)0x00000004U)         /*!< BIT DLC_2  */
#define CAN_LLC_FORMAT_DLC_3         ((uint32_t)0x00000008U)         /*!< BIT DLC_3  */
#define CAN_LLC_FORMAT_IDE           ((uint32_t)0x00010000U)         /*!< BIT IDE    */
#define CAN_LLC_FORMAT_FDF           ((uint32_t)0x00020000U)         /*!< BIT FDF    */
#define CAN_LLC_FORMAT_RMF           ((uint32_t)0x00100000U)         /*!< BIT RMF    */
#define CAN_LLC_FORMAT_KOER_0        ((uint32_t)0x01000000U)         /*!< BIT KOER_0 */
#define CAN_LLC_FORMAT_KOER_1        ((uint32_t)0x02000000U)         /*!< BIT KOER_1 */
#define CAN_LLC_FORMAT_KOER_2        ((uint32_t)0x04000000U)         /*!< BIT KOER_2 */
#define CAN_LLC_FORMAT_LBF           ((uint32_t)0x10000000U)         /*!< BIT LBF    */

#define CAN_LLC_FORMAT_DLC           ((uint32_t)0x0000000FU)         /*!< BIT DLC    */
#define CAN_LLC_FORMAT_KOER          ((uint32_t)0x07000000U)         /*!< BIT KOER   */

#define CAN_LLC_FORMAT_KOER_Pos      (24)                            /*!< BIT KOER Pos   */
/**
  * @}
  */

/** @defgroup CAN_id_type CAN id type
  * @{
  */
#define CAN_STANDARD_ID            ((uint32_t)0x00000000U)         /*!< Standard ID element */
#define CAN_EXTENDED_ID            ((uint32_t)0x00010000U)         /*!< Extended ID element */
/**
  * @}
  */

/** @defgroup CAN_format CAN Frame Format
  * @{
  */
#define CAN_CLASSIC_CAN            ((uint32_t)0x00000000U)         /*!< Classic frame      */
/**
  * @}
  */

/** @defgroup CAN_frame_type CAN frame type
  * @{
  */
#define CAN_DATA_FRAME                   ((uint32_t)0x00000000U)         /*!< data frame        */
#define CAN_REMOTE_FRAME                 ((uint32_t)0x00100000U)         /*!< remote frame      */
/**
  * @}
  */

/** @defgroup CAN_protocol_error_type CAN frame error type
  * @{
  */
#define CAN_PROTOCOL_NONE_ERROR             ((uint32_t)0x00000000U)         /*!< no error                     */
#define CAN_PROTOCOL_BIT_ERROR              ((uint32_t)0x00000001U)         /*!< frame bit error              */
#define CAN_PROTOCOL_FORM_ERROR             ((uint32_t)0x00000002U)         /*!< frame form error             */
#define CAN_PROTOCOL_STUFF_ERROR            ((uint32_t)0x00000003U)         /*!< frame bit sruff error        */
#define CAN_PROTOCOL_ACK_ERROR              ((uint32_t)0x00000004U)         /*!< frame ack error              */
#define CAN_PROTOCOL_CRC_ERROR              ((uint32_t)0x00000005U)         /*!< all stored data are invalid  */
#define CAN_PROTOCOL_OTHER_ERROR            ((uint32_t)0x00000006U)         /*!< OTHER ERROR  */
/**
  * @}
  */

/** @defgroup CAN_loopback_frame CAN loop back frame
  * @{
  */
#define CAN_LOOPBACK_FRAME_ON         ((uint32_t)0x00000000U)         /*!< CAN receive frame is LoopBack frame     */
#define CAN_LOOPBACK_FRAME_OFF        ((uint32_t)0x10000000U)         /*!< CAN receive frame is not LoopBack frame */
/**
  * @}
  */

/** @defgroup CAN_operating_mode CAN Operating Mode
* @{
*/
#define CAN_MODE_NORMAL                (0x00000000U)                                  /*!< Normal mode   */
#define CAN_MODE_RESTRICTED_OPERATION  ((uint32_t)CAN_TSNCR_ROP)                    /*!< Restricted operation mode */
#define CAN_MODE_LOOPBACK_EXT_NOACK    ((uint32_t)CAN_MCR_LBME)                     /*!< Loopback mode */
#define CAN_MODE_LOOPBACK_EXT_ACK      ((uint32_t)(CAN_MCR_LBME | CAN_MCR_SACK))  /*!< Loopback mode */
#define CAN_MODE_LOOPBACK_INT          ((uint32_t)CAN_MCR_LBMI)                     /*!< Loopback mode */
#define CAN_MODE_SILENT                ((uint32_t)CAN_MCR_LOM)                      /*!< Silent mode   */
#define CAN_MODE_SILENT_LOOPBACK       ((uint32_t)(CAN_MCR_LOM | CAN_MCR_LBME))   /*!< Loopback combined with silent mode */
/**
  * @}
  */

/** @defgroup CAN_retransmission_Limit CAN Retransmission Limit
* @{
*/
#define CAN_AUTO_RETRANSMISSION_1TRANSFER           (0x00000000U)
#define CAN_AUTO_RETRANSMISSION_2TRANSFERS          ((uint32_t)CAN_RLSSP_RETLIM_0)
#define CAN_AUTO_RETRANSMISSION_3TRANSFERS          ((uint32_t)CAN_RLSSP_RETLIM_1)
#define CAN_AUTO_RETRANSMISSION_4TRANSFERS          ((uint32_t)(CAN_RLSSP_RETLIM_0|CAN_RLSSP_RETLIM_1))
#define CAN_AUTO_RETRANSMISSION_5TRANSFERS          ((uint32_t)CAN_RLSSP_RETLIM_2)
#define CAN_AUTO_RETRANSMISSION_6TRANSFERS          ((uint32_t)(CAN_RLSSP_RETLIM_0 | CAN_RLSSP_RETLIM_2))
#define CAN_AUTO_RETRANSMISSION_7TRANSFERS          ((uint32_t)(CAN_RLSSP_RETLIM_1 | CAN_RLSSP_RETLIM_2))
#define CAN_AUTO_RETRANSMISSION_NO_LIMIT            ((uint32_t)(CAN_RLSSP_RETLIM_0 | CAN_RLSSP_RETLIM_1 | CAN_RLSSP_RETLIM_2))
/**
  * @}
  */

/** @defgroup CAN_rearbitration_Limit CAN Rearbitration Limit
* @{
*/
#define CAN_AUTO_REARBITRATION_1TRANSFER           (0x00000000U)
#define CAN_AUTO_REARBITRATION_2TRANSFERS          ((uint32_t)CAN_RLSSP_REALIM_0)
#define CAN_AUTO_REARBITRATION_3TRANSFERS          ((uint32_t)CAN_RLSSP_REALIM_1)
#define CAN_AUTO_REARBITRATION_4TRANSFERS          ((uint32_t)(CAN_RLSSP_REALIM_0|CAN_RLSSP_REALIM_1))
#define CAN_AUTO_REARBITRATION_5TRANSFERS          ((uint32_t)CAN_RLSSP_REALIM_2)
#define CAN_AUTO_REARBITRATION_6TRANSFERS          ((uint32_t)(CAN_RLSSP_REALIM_0 | CAN_RLSSP_REALIM_2))
#define CAN_AUTO_REARBITRATION_7TRANSFERS          ((uint32_t)(CAN_RLSSP_REALIM_1 | CAN_RLSSP_REALIM_2))
#define CAN_AUTO_REARBITRATION_NO_LIMIT            ((uint32_t)(CAN_RLSSP_REALIM_0 | CAN_RLSSP_REALIM_1 | CAN_RLSSP_REALIM_2))
/**
  * @}
  */
  
/** @defgroup CAN_RX_FIFO_threshold CAN receive fifo almost full warning limit.
* @{
*/
#define CAN_RX_FIFO_THRESHOLD_1SLOT          ((uint32_t)CAN_WECR_AFWL_0)
#define CAN_RX_FIFO_THRESHOLD_2SLOTS         ((uint32_t)CAN_WECR_AFWL_1)
#define CAN_RX_FIFO_THRESHOLD_3SLOTS         ((uint32_t)(CAN_WECR_AFWL_0 | CAN_WECR_AFWL_1))
/**
  * @}
  */

/**
 * @defgroup CAN_transmit_mode CAN transmit Mode
 * @{
 */
#define CAN_TXFIFO_PTB_SEND            (0x00000001U)
#define CAN_TXFIFO_STB_SEND_ONE        (0x00000002U)
#define CAN_TXFIFO_STB_SEND_ALL        (0x00000004U)
/**
 * @}
 */

/**
* @defgroup CAN_filter_channel CAN Acceptance Channel
* @{
*/
#define CAN_FILTER_CHANNEL_0           (0x00000000U)
#define CAN_FILTER_CHANNEL_1           (0x00000001U)
#define CAN_FILTER_CHANNEL_2           (0x00000002U)
#define CAN_FILTER_CHANNEL_3           (0x00000003U)
#define CAN_FILTER_CHANNEL_4           (0x00000004U)
#define CAN_FILTER_CHANNEL_5           (0x00000005U)
#define CAN_FILTER_CHANNEL_6           (0x00000006U)
#define CAN_FILTER_CHANNEL_7           (0x00000007U)
#define CAN_FILTER_CHANNEL_8           (0x00000008U)
#define CAN_FILTER_CHANNEL_9           (0x00000009U)
#define CAN_FILTER_CHANNEL_10          (0x0000000AU)
#define CAN_FILTER_CHANNEL_11          (0x0000000BU)
/**
 * @}
 */

/** @defgroup CAN_filter_rank CAN Filter rank
  * @{
  */
#define CAN_FILTER_RANK_CHANNEL_NUMBER (0x00000000U)  /*!< Enable the rank of the selected channels.  */
#define CAN_FILTER_RANK_NONE           (0x00000001U)  /*!< Disable the selected rank (selected channel).  */
/**
  * @}
  */

/**
 * @defgroup CAN_RX_FIFO_overflow_mode CAN Receive Buffer Overflow Mode
 * @{
 */
#define CAN_RX_FIFO_OVERWRITE          (0x00000000U)    /*!< Rx FIFO overwrite mode */
#define CAN_RX_FIFO_BLOCKING           (CAN_MCR_ROM)   /*!< Rx FIFO blocking mode  */
/**
 * @}
 */

/**
 * @defgroup CAN_receive_fifo_state CAN Receive Buffer Overflow Mode
 * @{
 */
#define CAN_RX_FIFO_EMPTY                    (0x00000000U)                           /*!< Rx FIFO empty  */
#define CAN_RX_FIFO_LE_AFWL                  (CAN_MCR_RSTAT_0)                     /*!< Rx FIFO more than empty and less than almost full (AFWL) */
#define CAN_RX_FIFO_GT_AFWL                  (CAN_MCR_RSTAT_1)                     /*!< Rx FIFO Greater than or equal to almost full */
#define CAN_RX_FIFO_FULL                     (CAN_MCR_RSTAT_0 | CAN_MCR_RSTAT_1) /*!< Rx FIFO full */
/**
 * @}
 */

/**
 * @defgroup CAN_receive_fifo_state CAN Transmit Buffer Overflow Mode
 * @{
 */
#define CAN_STB_FIFO_EMPTY                  (0x00000000U)   /*!< STB FIFO empty  */
#define CAN_STB_FIFO_LE_HF                  (CAN_MCR_TSSTAT_0)   /*!< STB FIFO less than or equal to half full */
#define CAN_STB_FIFO_GT_HF                  (CAN_MCR_TSSTAT_1)   /*!< STB FIFO More than half full */
#define CAN_STB_FIFO_FULL                   (CAN_MCR_TSSTAT_0 | CAN_MCR_TSSTAT_1)   /*!< STB FIFO full */
/**
 * @}
 */

/**
 * @defgroup CAN_fifo_type CAN Transmit FIFO type
 * @{
 */
#define CAN_TX_FIFO_PTB                     (0x0U)
#define CAN_TX_FIFO_STB                     (0x1U)
/**
 * @}
 */

/**
 * @defgroup CAN_STB_priority_mode CAN STB Priority Mode
 * @{
 */
#define CAN_STB_PRIORITY_FIFO               (0x0U)                  /*!< Data first in and first be transmitted. */
#define CAN_STB_PRIORITY_ID                 (CAN_MCR_TSMODE)      /*!< Data with smallest ID first be transmitted. */
/**
 * @}
 */

/**
 * @defgroup CAN_transmit_status CAN Tx Frame status
 * @{
 */
#define CAN_TRANSMIT_STATUS_IDLE               (0x00000000U)                  /*!< No transmission in progress. */
#define CAN_TRANSMIT_STATUS_ONGOING            (0x00000001U)                  /*!< Transmission active without any issues. */
#define CAN_TRANSMIT_STATUS_LOST_ARBITRATION   (0x00000002U)                  /*!< Arbitration lost. re-arbitration may take place with respect to REALIM. */
#define CAN_TRANSMIT_STATUS_TRANSMITTED        (0x00000003U)                  /*!< Transmission successfully completed. */
#define CAN_TRANSMIT_STATUS_ABORTED            (0x00000004U)                  /*!< Transmission aborted (TPA, TSA). */
#define CAN_TRANSMIT_STATUS_DISTURBED          (0x00000005U)                  /*!< Transmission error. Retransmission may take place with respect to RETLIM. */
#define CAN_TRANSMIT_STATUS_REJECTED           (0x00000006U)                  /*!< Misconfiguration of the frame format in the LLC frame. */
/**
 * @}
 */
 
/**
 * @defgroup CAN_TT_trigger_type TTCAN Trigger Type
 * @{
 */
#define CAN_TT_IMMEDIATE_TRIGGER        (0x0U)
#define CAN_TT_RX_TIME_TRIG             (CAN_TTCR_TTYPE_0)
#define CAN_TT_TX_SINGLE_TRIG           (CAN_TTCR_TTYPE_1)
#define CAN_TT_TX_START_TRIG            (CAN_TTCR_TTYPE_0 | CAN_TTCR_TTYPE_1)
#define CAN_TT_TX_STOP_TRIG             (CAN_TTCR_TTYPE_2)
/**
 * @}
 */

/**
 * @defgroup CAN_TTCAN_FIFO_mode TTCAN FIFO mode
 * @{
 */
#define CAN_TT_FIFO_PTB_STB           (0x0U)
#define CAN_TT_FIFO_MERGE             (CAN_MCR_TTTBM)
/**
 * @}
 */

/**
 * @defgroup CAN_TT_FIFO_INDEX TTCAN FIFO index
 * @{
 */
#define CAN_TT_FIFO_SLOT0             (0x00000000U)
#define CAN_TT_FIFO_SLOT1             (0x00000001U)
#define CAN_TT_FIFO_SLOT2             (0x00000002U)
#define CAN_TT_FIFO_SLOT3             (0x00000003U)
/**
 * @}
 */

/**
 * @defgroup CAN_TT_FIFO_State_Set TTCAN FIFO State Set
 * @{
 */
#define CAN_TT_FIFO_SLOT_SET_EMPTY    (CAN_TTCR_TBE)
#define CAN_TT_FIFO_SLOT_SET_FULL     (CAN_TTCR_TBF)
/**
 * @}
 */
 
/** @defgroup CAN_timestamp_prescaler CAN timestamp prescaler
  * @{
  */
#define CAN_TT_PRESC_1                ((uint32_t)0x00000000U)                       /*!< Timestamp counter time unit in equal to CAN bit time                 */
#define CAN_TT_PRESC_2                (CAN_TTCR_T_PRESC_0)                        /*!< Timestamp counter time unit in equal to CAN bit time multiplied by 2  */
#define CAN_TT_PRESC_4                (CAN_TTCR_T_PRESC_1)                        /*!< Timestamp counter time unit in equal to CAN bit time multiplied by 4  */
#define CAN_TT_PRESC_8                (CAN_TTCR_T_PRESC_0 |CAN_TTCR_T_PRESC_1)  /*!< Timestamp counter time unit in equal to CAN bit time multiplied by 8  */
/**
  * @}
  */

/** @defgroup CAN_flags CAN Flags
  * @{
  */
#define CAN_FLAG_TX_STB_COMPLETE             CAN_IFR_TSIF             /*!< STB Transmission Completed   */
#define CAN_FLAG_TX_PTB_COMPLETE             CAN_IFR_TPIF             /*!< PTB Transmission Completed   */
#define CAN_FLAG_TX_ABORT_COMPLETE           CAN_IFR_AIF              /*!< Transmission Cancellation Finished */
#define CAN_FLAG_RX_COMPLETE                 CAN_IFR_RIF              /*!< Rx Completed   */
#define CAN_FLAG_RX_FIFO_ALMOST_FULL         CAN_IFR_RAFIF            /*!< Rx FIFO almost full */
#define CAN_FLAG_RX_FIFO_FULL                CAN_IFR_RFIF             /*!< Rx FIFO full */
#define CAN_FLAG_RX_FIFO_OVERFLOW            CAN_IFR_ROIF             /*!< Overflow of CAN Rx FIFO   */
#define CAN_FLAG_ARB_LOST                    CAN_IFR_ALIF             /*!< Arbitration lost detected   */
#define CAN_FLAG_ERROR_PASSIVE               CAN_IFR_EPIF             /*!< Error_Passive status changed  */
#define CAN_FLAG_BUS_ERROR                   CAN_IFR_BEIF             /*!< Bus_Off status changed       */
#define CAN_FLAG_ERROR_TOGGLE                CAN_IFR_EIF              /*!< Bus_Off status changed or Error_Passive status changed    */
#define CAN_FLAG_TRIGGER_COMPLETE            CAN_IFR_TTIF             /*!< Trigger Interrupt flag   */
#define CAN_FLAG_TRIGGER_ERROR               CAN_IFR_TEIF             /*!< Trigger error Interrupt flag   */
#define CAN_FLAG_TIMESTAMP_WRAPAROUND        CAN_IFR_WTIF             /*!< Timestamp counter wrapped around */

