espruino/Espruino/libs/banglejs/banglejs3_py32/libs/hal/inc/py32f07x_hal_can.h
#define CAN_FLAG_ALL_ERROR                   (CAN_FLAG_RX_FIFO_OVERFLOW | CAN_FLAG_ARB_LOST  |  \
                                                CAN_FLAG_ERROR_PASSIVE    | CAN_FLAG_BUS_ERROR |  \
                                                CAN_FLAG_ERROR_TOGGLE     | CAN_FLAG_TRIGGER_ERROR)
/**
  * @}
  */

/** @defgroup CAN_interrupts CAN Interrupts
  * @{
  */
#define CAN_IT_TX_STB_COMPLETE           CAN_IER_TSIE             /*!< STB Transmission Completed */
#define CAN_IT_TX_PTB_COMPLETE           CAN_IER_TPIE             /*!< PTB Transmission Completed */
#define CAN_IT_ERROR_TOGGLE              CAN_IER_EIE              /*!< Bus_Off status changed or Error_Passive status changed    */
#define CAN_IT_RX_FIFO_ALMOST_FULL       CAN_IER_RAFIE            /*!< Rx FIFO almost full */
#define CAN_IT_RX_FIFO_FULL              CAN_IER_RFIE             /*!< Rx FIFO full */
#define CAN_IT_RX_FIFO_OVERFLOW          CAN_IER_ROIE             /*!< Overflow of CAN Rx FIFO   */
#define CAN_IT_RX_COMPLETE               CAN_IER_RIE              /*!< Rx Completed   */
#define CAN_IT_ARB_LOST                  CAN_IER_ALIE             /*!< Arbitration lost detected   */
#define CAN_IT_ERROR_PASSIVE             CAN_IER_EPIE             /*!< Error_Passive status changed  */
#define CAN_IT_BUS_ERROR                 CAN_IER_BEIE             /*!< Bus_Off status changed       */
#define CAN_IT_TRIGGER_COMPLETE          CAN_IER_TTIE             /*!< Trigger Interrupt flag   */
#define CAN_IT_TIMESTAMP_WRAPAROUND      CAN_IER_WTIE             /*!< Timestamp counter wrapped around */

#define CAN_IT_ALL_ERROR                 (CAN_IT_ERROR_TOGGLE | CAN_IT_RX_FIFO_OVERFLOW | \
                                            CAN_IT_ARB_LOST     | CAN_IT_ERROR_PASSIVE    | \
                                            CAN_IT_BUS_ERROR)
/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup CAN_Exported_Macros CAN Exported Macros
  * @{
  */

/**
  * @brief  Enable the specified CAN interrupts.
  * @param  __HANDLE__ CAN handle.
  * @param  __INTERRUPT__ CAN interrupt.
  *         This parameter can be any combination of @arg CAN_Interrupts
  * @retval None
  */
#define __HAL_CAN_ENABLE_IT(__HANDLE__, __INTERRUPT__)             \
  (__HANDLE__)->Instance->IER |= (__INTERRUPT__)

/**
  * @brief  Disable the specified CAN interrupts.
  * @param  __HANDLE__ CAN handle.
  * @param  __INTERRUPT__ CAN interrupt.
  *         This parameter can be any combination of @arg CAN_Interrupts
  * @retval None
  */
#define __HAL_CAN_DISABLE_IT(__HANDLE__, __INTERRUPT__)               \
  ((__HANDLE__)->Instance->IER) &= ~(__INTERRUPT__)
  
/** @brief  Check if the specified CAN interrupt source is enabled or disabled.
  * @param  __HANDLE__ CAN handle.
  * @param  __INTERRUPT__ specifies the CAN interrupt source to check.
  *         This parameter can be a value of @arg CAN_Interrupts
  * @retval ITStatus
  */
#define __HAL_CAN_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER & (__INTERRUPT__))

/**
  * @brief  Check whether the specified CAN flag is set or not.
  * @param  __HANDLE__ CAN handle.
  * @param  __FLAG__ CAN flag.
  *         This parameter can be one of @arg CAN_flags
  * @retval FlagStatus
  */
#define __HAL_CAN_GET_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->IFR & (__FLAG__))

/**
  * @brief  Clear the specified CAN flags.
  * @param  __HANDLE__ CAN handle.
  * @param  __FLAG__ specifies the flags to clear.
  *         This parameter can be any combination of @arg CAN_flags
  * @retval None
  */
#define __HAL_CAN_CLEAR_FLAG(__HANDLE__, __FLAG__)             \
  ((__HANDLE__)->Instance->IFR) = (__FLAG__)

/** @brief  Return Rx FIFO fill level.
  * @param  __HANDLE__ CAN handle.
  * @retval Rx FIFO fill level.
  */
#define __HAL_CAN_GET_RX_FIFO_FILL_LEVEL(__HANDLE__) ((__HANDLE__)->Instance->MCR & CAN_MCR_RSTAT)

/** @brief  Return STB FIFO free level.
  * @param  __HANDLE__ CAN handle.
  * @retval STB FIFO free level.
  */
#define __HAL_CAN_GET_STB_FIFO_FREE_LEVEL(__HANDLE__) ((__HANDLE__)->Instance->MCR & CAN_MCR_TSSTAT)

/**
  * @brief  Enable canbus OFF.
  * @param  __HANDLE__ CAN handle.
  * @retval None
  */
#define __HAL_CAN_EnableCanBusOff(__HANDLE__)  (SET_BIT((__HANDLE__)->Instance->MCR, CAN_MCR_BUSOFF))

/**
  * @brief  Disable canbus OFF.
  * @param  __HANDLE__ CAN handle.
  * @retval None
  */
#define __HAL_CAN_DisableCanBusOff(__HANDLE__)  (CLEAR_BIT((__HANDLE__)->Instance->MCR, CAN_MCR_BUSOFF))
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup CNAFD_Private_Macros CAN Private Macros
  * @{
  */
#define IS_CAN_FRAME_FORMAT(FORMAT)   ((FORMAT) == CAN_FRAME_CLASSIC)
#define IS_CAN_MODE(MODE)  (((MODE) == CAN_MODE_NORMAL) || \
                              ((MODE) == CAN_MODE_RESTRICTED_OPERATION) || \
                              ((MODE) == CAN_MODE_LOOPBACK_EXT_NOACK) || \
                              ((MODE) == CAN_MODE_LOOPBACK_EXT_ACK) || \
                              ((MODE) == CAN_MODE_LOOPBACK_INT) || \
                              ((MODE) == CAN_MODE_SILENT) || \
                              ((MODE) == CAN_MODE_SILENT_LOOPBACK))
#define IS_CAN_CKDIV(DIV)  (((DIV) >= 1U) && ((DIV) <= 32U))
#define IS_CAN_NOMINAL_SJW(SJW)  (((SJW) >= 1U) && ((SJW) <= 128U))
#define IS_CAN_NOMINAL_TSEG1(TSEG1)  (((TSEG1) >= 2U) && ((TSEG1) <= 513U))
#define IS_CAN_NOMINAL_TSEG2(TSEG2)  (((TSEG2) >= 1U) && ((TSEG2) <= 128U))

#define IS_CAN_ID_TYPE(TYPE)   (((TYPE) == CAN_STANDARD_ID) || \
                                  ((TYPE) == CAN_EXTENDED_ID))
#define IS_CAN_FILTER_CHANNEL(CHANNEL)  ((CHANNEL) <= CAN_FILTER_CHANNEL_11)
#define IS_CAN_RANK(RANK)   (((RANK) == CAN_FILTER_RANK_CHANNEL_NUMBER) || \
                               ((RANK) == CAN_FILTER_RANK_NONE))
#define IS_CAN_FILTER_ID(ID)  ((ID) <= 0x1FFFFFFFU)
#define IS_CAN_FILTER_FORMAT(FORMAT)  ((FORMAT) <= 0x1F1707FFU)
#define IS_CAN_MASK_ID(ID)  ((ID) <= 0x1FFFFFFFU)
#define IS_CAN_MASK_FORMAT(FORMAT)  ((FORMAT) <= 0x1F1707FFU)

#define IS_CAN_MAX_VALUE(ID, VALUE)  ((ID) <= VALUE)
#define IS_CAN_TX_FRAME_TYPE(TYPE)   (((TYPE) == CAN_DATA_FRAME) || \
                                        ((TYPE) == CAN_REMOTE_FRAME))
#define IS_CAN_Handle(ID)  ((ID) <= 0xFFU)
#define IS_CAN_DLC(DLC)  ((DLC) <= CAN_DLC_BYTES_8)
#define IS_CAN_TX_FIFO_TYPE(TYPE)   (((TYPE) == CAN_TX_FIFO_PTB) || \
                                        ((TYPE) == CAN_TX_FIFO_STB))

