espruino/Espruino/libs/banglejs/banglejs3_py32/libs/hal/inc/py32f07x_hal_can.h
#define IS_CAN_TRANSMIT_MODE(MODE)   (((MODE) == CAN_TXFIFO_PTB_SEND) || \
                                        ((MODE) == CAN_TXFIFO_STB_SEND_ONE) || \
                                        ((MODE) == CAN_TXFIFO_STB_SEND_ALL))

#define IS_CAN_REARBITRATION_LIMIT(LIMIT)  ((LIMIT) <= CAN_AUTO_REARBITRATION_NO_LIMIT)

#define IS_CAN_RETRANSMISSION_LIMIT(LIMIT)  ((LIMIT) <= CAN_AUTO_RETRANSMISSION_NO_LIMIT)

#define IS_CAN_STB_PRIORITY(PRIORITY)   (((PRIORITY) == CAN_STB_PRIORITY_FIFO) || \
                                           ((PRIORITY) == CAN_STB_PRIORITY_ID))

#define IS_CAN_RX_FIFO_MODE(MODE)   (((MODE) == CAN_RX_FIFO_OVERWRITE) || \
                                       ((MODE) == CAN_RX_FIFO_BLOCKING))

#define IS_CAN_RX_FIFO_THRESHOLD(THRESHOLD)   (((THRESHOLD) == CAN_RX_FIFO_THRESHOLD_1SLOT) || \
                                                 ((THRESHOLD) == CAN_RX_FIFO_THRESHOLD_2SLOTS) || \
                                                 ((THRESHOLD) == CAN_RX_FIFO_THRESHOLD_3SLOTS))

#define IS_CAN_TT_FIFO_MODE(MODE)   (((MODE) == CAN_TT_FIFO_PTB_STB) || \
                                       ((MODE) == CAN_TT_FIFO_MERGE))
#define IS_CAN_TT_PRESCALER(PRESCALER)   (((PRESCALER) == CAN_TT_PRESC_1) || \
                                            ((PRESCALER) == CAN_TT_PRESC_2) ||\
                                            ((PRESCALER) == CAN_TT_PRESC_4) ||\
                                            ((PRESCALER) == CAN_TT_PRESC_8))
#define IS_CAN_TX_ENABLE_WINDOW(WINDOW)  (((WINDOW) >= 1U) && ((WINDOW) <= 15U))
#define IS_CAN_WATCH_TRIG_TIME(TIME)  ((TIME) <= 0xFFFFU)
/**
  * @}
  */

/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @addtogroup CAN_Exported_Functions
  * @{
  */

/** @addtogroup CAN_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */

/* Initialization/de-initialization functions  **********************************/
HAL_StatusTypeDef HAL_CAN_Init(CAN_HandleTypeDef *hcan);
void HAL_CAN_MspInit(CAN_HandleTypeDef *hcan);

/* Callbacks Register/UnRegister functions  ***********************************/
#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
HAL_StatusTypeDef HAL_CAN_RegisterCallback(CAN_HandleTypeDef *hcan, HAL_CAN_CallbackIDTypeDef CallbackID, void (* pCallback)(CAN_HandleTypeDef *_hCAN));
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @addtogroup CAN_Exported_Functions_Group2 IO operation functions
  * @{
  */

/* IO operation functions *******************************************************/
HAL_StatusTypeDef HAL_CAN_ConfigFilter(CAN_HandleTypeDef *hcan, CAN_FilterTypeDef *sFilter);
HAL_StatusTypeDef HAL_CAN_AddMessageToTxFifo(CAN_HandleTypeDef *hcan, CAN_TxHeaderTypeDef *pTxHeader, uint8_t *pData, uint32_t TxFifoType);
HAL_StatusTypeDef HAL_CAN_ActivateTxRequest(CAN_HandleTypeDef *hcan, uint32_t activeTxMode);
HAL_StatusTypeDef HAL_CAN_GetRxMessage(CAN_HandleTypeDef *hcan, CAN_RxHeaderTypeDef *pRxHeader, uint8_t *pRxData);
HAL_StatusTypeDef HAL_CAN_AbortTxRequest(CAN_HandleTypeDef *hcan, uint32_t TransmitType);
HAL_StatusTypeDef HAL_CAN_ConfigRearbitrationLimit(CAN_HandleTypeDef *hcan, uint32_t reaLimit);
HAL_StatusTypeDef HAL_CAN_ConfigRetransmissionLimit(CAN_HandleTypeDef *hcan, uint32_t retLimit);
HAL_StatusTypeDef HAL_CAN_ConfigTxFifoPriority(CAN_HandleTypeDef *hcan, uint32_t StbPriority);
HAL_StatusTypeDef HAL_CAN_ConfigRxFifoOverwrite(CAN_HandleTypeDef *hcan, uint32_t OverflowMode);
HAL_StatusTypeDef HAL_CAN_ConfigRxFifoThreshold(CAN_HandleTypeDef *hcan, uint32_t Threshold);
HAL_StatusTypeDef HAL_CAN_EnableReceiveErrorDataFrame(CAN_HandleTypeDef *hcan);
HAL_StatusTypeDef HAL_CAN_DisableReceiveErrorDataFrame(CAN_HandleTypeDef *hcan);
HAL_StatusTypeDef HAL_CAN_TT_Config(CAN_HandleTypeDef *hcan, CAN_TimeTriggerTypeDef *pTTConfig);
HAL_StatusTypeDef HAL_CAN_TT_AddMessageToFifo(CAN_HandleTypeDef *hcan, CAN_TxHeaderTypeDef *txHeader, uint8_t *pData, uint32_t slotIndex);
HAL_StatusTypeDef HAL_CAN_TT_ActivateTrigRequest(CAN_HandleTypeDef *hcan, uint32_t triggerType, uint32_t trigTime, uint32_t slotIndex);
HAL_StatusTypeDef HAL_CAN_TT_ConfigTxBufferState(CAN_HandleTypeDef *hcan, uint32_t slotIndex, uint32_t slotState);
HAL_StatusTypeDef HAL_CAN_Start(CAN_HandleTypeDef *hcan);
HAL_StatusTypeDef HAL_CAN_ActivateNotification(CAN_HandleTypeDef *hcan, uint32_t activeITs);
HAL_StatusTypeDef HAL_CAN_DeactivateNotification(CAN_HandleTypeDef *hcan, uint32_t inactiveITs);
HAL_StatusTypeDef HAL_CAN_EnterStandbyMode(CAN_HandleTypeDef *hcan);
HAL_StatusTypeDef HAL_CAN_ExitStandbyMode(CAN_HandleTypeDef *hcan);
HAL_StatusTypeDef HAL_CAN_GetProtocolStatus(CAN_HandleTypeDef *hcan, CAN_ProtocolStatusTypeDef *ProtocolStatus);
HAL_StatusTypeDef HAL_CAN_GetTransmitStatus(CAN_HandleTypeDef *hcan, CAN_TxStatusTypeDef *TxStatus);
HAL_StatusTypeDef HAL_CAN_Stop(CAN_HandleTypeDef *hcan);

void HAL_CAN_IRQHandler(CAN_HandleTypeDef *hcan);
void HAL_CAN_RxCpltCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_RxFifoAlmostFullCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_RxFifoFullCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_PtbTxCpltCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_StbTxCpltCallback(CAN_HandleTypeDef *hcan, uint32_t LastSTBTxType);
void HAL_CAN_RxFifoOverflowCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_ArbitrationLostCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_TxAbortCallback(CAN_HandleTypeDef *hcan, uint32_t LastAbortTxType);
void HAL_CAN_PassiveErrorCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_BusErrorCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_ErrorChangeCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_TT_RxTimeTrigCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_TT_TxSingleTrigCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_TT_TxStartTrigCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_TT_TxStopTrigCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_TT_TimestampWraparoundCallback(CAN_HandleTypeDef *hcan);
void HAL_CAN_TT_TrigErrorCallback(CAN_HandleTypeDef *hcan);

#ifdef __cplusplus
}
#endif

#endif /* __PY32F07X_HAL_CAN_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
